In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame([[1], [2]], columns = ['a'])
print(df)

   a
0  1
1  2

In [17]:
df['b']= pd.DataFrame([[3], [2]])

In [18]:
df

     b
0  3.0
1  2.0
2  NaN
3  NaN
4  NaN
5  NaN
6  NaN

In [19]:
df = df.append(pd.DataFrame([[3, 4]], columns = ['a', 'b']))
df = df.reset_index(drop=True)
df

     b    a
0  3.0  NaN
1  2.0  NaN
2  NaN  NaN
3  NaN  NaN
4  NaN  NaN
5  NaN  NaN
6  NaN  NaN
7  4.0  3.0

In [20]:
del df['a']

In [21]:
df.pop('b')

0    3.0
1    2.0
2    NaN
3    NaN
4    NaN
5    NaN
6    NaN
7    4.0
Name: b, dtype: float64

In [22]:
df

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6, 7]

In [24]:
df = pd.DataFrame([[1], [2]], columns = ['a'])

In [25]:
df

   a
0  1
1  2

In [26]:
one = pd.DataFrame({
    'id':[1, 2],
    'Name': ['Alex', 'Amy'],
})
two = pd.DataFrame({
    'id':[1, 2],
    'Name': ['Bob', 'Tom']
})

pd.concat([one, two])

   id  Name
0   1  Alex
1   2   Amy
0   1   Bob
1   2   Tom

In [27]:
pd.concat([one, two]).reset_index(drop=True)

   id  Name
0   1  Alex
1   2   Amy
2   1   Bob
3   2   Tom

In [28]:
one = pd.DataFrame({
    'id':[1, 2],
    'Name': ['Alex', 'Amy'],
})
two = pd.DataFrame({
    'id':[1, 2],
    'Score': [98, 60]
})

pd.merge(one, two, on='id')

   id  Name  Score
0   1  Alex     98
1   2   Amy     60

In [29]:
one = pd.DataFrame({
    'Name': ['Alex', 'Amy'],
})
two = pd.DataFrame({
    'Score': [98, 60]
})

one.join(two)

   Name  Score
0  Alex     98
1   Amy     60

In [30]:
df = pd.DataFrame({
  'A' : ['foo', 'bar', 'foo', 'bar'],
  'B' : ['one', 'one', 'two', 'three'],
  'C' : [1,2,3,4],
  'D' : [10, 20, 30, 40]
})

In [31]:
df.groupby('A').sum()

     C   D
A
bar  6  60
foo  4  40

In [32]:
df.groupby('A').agg(sum)

     C   D
A
bar  6  60
foo  4  40

In [34]:
df.groupby(['B']).sum()

       C   D
B
one    3  30
three  4  40
two    3  30